Config/Reports/СведенияОПлановыхНазначениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СведенияОПлановыхНазначениях</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Catalogs/Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Reports/СведенияОПлановыхНазначениях/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураБыстрыеОтборы = Новый Структура("Организация,НачалоПериода,КонецПериода");
	
	РегламентированныеРегистры.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Для каждого КлючЗначение из СтруктураБыстрыеОтборы цикл
		Значение = Неопределено;
		Если Параметры.Свойство(КлючЗначение.Ключ, Значение) тогда
			Отчет[КлючЗначение.Ключ] = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Отчет.РежимРасшифровки = Параметры.ПредставлениеВарианта = "Расшифровка";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	ВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ВариантМодифицирован                    = Ложь;
	ПользовательскиеНастройкиМодифицированы = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	СтандартныеОтчеты.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Настройки.ДополнительныеСвойства.Свойство("ТекущиеНастройки") Тогда
		ТекущиеНастройки = Настройки.ДополнительныеСвойства.ТекущиеНастройки.Получить();
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ТекущиеНастройки);
	КонецЕсли;	
	
	СтандартныеОтчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	ОбновитьОтображениеПериодаВОтборе();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	ОбновитьОтображениеПериодаВОтборе();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПолеКомпоновкиОрганизация                       = Новый ПолеКомпоновкиДанных("Организация");
	
	Для каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы цикл
		Если ЭлементОтбора.ЛевоеЗначение            = ПолеКомпоновкиОрганизация тогда
			ЭлементОтбора.Использование             = ЗначениеЗаполнено(Отчет.Организация);
			ЭлементОтбора.ПравоеЗначение            = Отчет.Организация;
			Для Каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл	
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки Тогда
					ЭлементНастройки.ЛевоеЗначение  = ПолеКомпоновкиОрганизация;
					ЭлементНастройки.Использование  = ЗначениеЗаполнено(Отчет.Организация);
					ЭлементНастройки.ПравоеЗначение = Отчет.Организация;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	ЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
	
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение      = МакетОформления;
	КонецЕсли;
	
	Для Каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл	
		Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЗначениеПараметра.ИдентификаторПользовательскойНастройки Тогда
			ЭлементНастройки.Использование = Истина;
			ЭлементНастройки.Значение      = МакетОформления;
		КонецЕсли;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеОтчета = Новый Структура("Организация, НачалоПериода, КонецПериода", Отчет.Организация, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ДополнительныеДействияИАдресПараметров = ПолучитьСписокДополнительнойРасшифровки(ДанныеОтчета,ДанныеРасшифровки,Расшифровка, ПоказательСчет);
	
	СтандартныеОтчетыКлиент.ОбработкаРасшифровкиСанкционирование(ЭтаФорма, Элемент, ДанныеРасшифровки, Расшифровка, ПоказательСчет)
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	СтандартныеОтчетыКлиент.РезультатПриАктивизацииОбласти(ЭтаФорма, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	СформироватьОтчетСервер();
	
	Результат.ИмяПараметровПечати  = "СведенияОПлановыхНазначениях";
	Результат.КлючПараметровПечати = "СведенияОПлановыхНазначениях";
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Отчет.ВидимостьНастроек = Не Элементы.ГруппаПанельНастроек.Видимость;
	ВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНастройки(Команда)
	
	ОткрытьФорму("Обработка.КонструкторПользовательскихНастроек.Форма",
			Новый Структура("КомпоновщикНастроек,Схема",Отчет.КомпоновщикНастроек,СхемаКомпоновкиДанных),,,,, Новый ОписаниеОповещения("ДополнительныеНастройкиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНастройкиЗавершение(ОтветФормы, ДополнительныеПараметры) Экспорт
	
	Если ОтветФормы <> Неопределено тогда
		ОбновитьКомпоновщикНастроек(ОтветФормы);	
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода", Отчет.НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода",  Отчет.КонецПериода);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма, "УстановитьПериодЗавершение");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВернутьПериод(знач ДатаНачала, знач ДатаОкончания)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("Датаокончания", Датаокончания);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ  1
	|	Периоды.Ссылка
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ДатаНачала = &ДатаНачала
	|	И Периоды.ДатаОкончания = &ДатаОкончания
	|";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Ссылка;
	Иначе
		Возврат Справочники.Периоды.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеПериодаВОтборе()
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьПериодЗавершение(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Отчет.НачалоПериода = РезультатВыбора.НачалоПериода;
		Отчет.КонецПериода  = РезультатВыбора.КонецПериода;
		ЭтаФорма.Модифицированность = Истина;
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
		ОбновитьОтображениеПериодаВОтборе();
	КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДополнительнойРасшифровки(ДанныеОтчета, ДанныеРасшифровки, Расшифровка, ПоказательСчет)
	
	Перем ПараметрыРасшифровкиДляСтандартныхОтчетов;
	
	ДополнительныеДействия = СтандартныеОтчетыВызовСервера.ПолучитьСписокДополнительнойРасшифровки(ДанныеОтчета, ДанныеРасшифровки, Расшифровка, ПоказательСчет, ПараметрыРасшифровкиДляСтандартныхОтчетов);
	Возврат Новый Структура("ДополнительныеДействия,ПараметрыРасшифровкиДляСтандартныхОтчетов",ДополнительныеДействия,ПараметрыРасшифровкиДляСтандартныхОтчетов);
	
КонецФункции	

&НаСервере
ПРоцедура ОбновитьКомпоновщикНастроек(КомпоновщикНастроек)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	
	Для каждого ЭлементОтбора из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") тогда
			Отчет.Организация = ЭлементОтбора.ПравоеЗначение;
			Если не ЭлементОтбора.Использование тогда
				Отчет.Организация = "";
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	ЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
	
	Если ЗначениеПараметра <> Неопределено Тогда
		МакетОформления = ЗначениеПараметра.Значение;
	КонецЕсли;
	
	Для Каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл	
		Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЗначениеПараметра.ИдентификаторПользовательскойНастройки Тогда
			МакетОформления = ЗначениеПараметра.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПРоцедуры

&НаСервере
Функция ОбновитьОтборы()
	
	Отчет.Организация = СтандартныеОтчеты.УстановитьЗначениеОтбора(Отчет.КомпоновщикНастроек, "Организация");
	
КонецФункции	

&НаСервере
Процедура СформироватьОтчетСервер() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода"                     , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                      , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("КомпоновщикНастроек"	    		 , Отчет.КомпоновщикНастроек);
	ПараметрыОтчета.Вставить("УникальныйИдентификатор"			 , ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"			 , СхемаКомпоновкиДанных);	
	ПараметрыОтчета.Вставить("Организация"						 , Отчет.Организация);	
	
	Отчеты.СведенияОПлановыхНазначениях.СформироватьОтчет(ПараметрыОтчета, ДанныеРасшифровки, Результат, ПоказательСчет, Отчет.РежимРасшифровки);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроек()
	
	Элементы.ГруппаПанельНастроек.Видимость = Отчет.ВидимостьНастроек;
	Элементы.ПанельНастроек.Пометка = Элементы.ГруппаПанельНастроек.Видимость;
	
КонецПРоцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет           = Форма.Отчет;
	ЗаголовокОтчета = "Сведения о плановых назначениях " + СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода, Истина);	
	Форма.Заголовок = ЗаголовокОтчета;
	
КонецПроцедуры

#КонецОбласти
